#include <iostream>
using namespace std;

int main()
{
    setlocale(LC_ALL, "");
    int a, d1, d2;
    cout << "Введите диапазон: ";
    cin >> d1 >> d2;
    cout << "Введите число с диапазона: ";
    cin >> a;
    if (d1 > d2) swap(d1, d2);
    // реализация определения принадлежности диапазону
    // с использованием дизъюнкции 
    (a > d2 || a < d1)?
        cout << "Не входит в диапазон [" << d1 << ";" << d2 << "]"
        : cout << "Входит в диапазон [" << d1 << ";" << d2 << "]";
        cout << "\n";
    // реализация определения принадлежности диапазону
    // с использованием конъюнкции  
    (a > d2 && a < d1)?
        cout << "Не входит в диапазон [" << d1 << ";" << d2 << "]"
        : cout << "Входит в диапазон [" << d1 << ";" << d2 << "]";
}